## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 0 to change, 10 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_route53_record.bounce-custom-notification-sandbox-MX[0]`         |
|        | `aws_route53_record.bounce-notification-sandbox-MX[0]`                |
|        | `aws_route53_record.bounce-notification-sandbox-TXT[0]`               |
|        | `aws_route53_record.custom-domain-aws-ses-sandbox-TXT[0]`             |
|        | `aws_route53_record.custom-domain-ses-sandbox-TXT[0]`                 |
|        | `aws_route53_record.dmarc-notification-sandbox-TXT[0]`                |
|        | `aws_route53_record.notification-sandbox-MX[0]`                       |
|        | `aws_route53_record.notification-sandbox-TXT[0]`                      |
|        | `aws_route53_record.ses-notification-sandbox-TXT[0]`                  |
| delete | `aws_route53_record.assets-staging-notification-sandbox-CNAME[0]`     |
|        | `aws_route53_record.bounce-staging-custom-notification-sandbox-MX[0]` |
|        | `aws_route53_record.bounce-staging-notification-sandbox-MX[0]`        |
|        | `aws_route53_record.bounce-staging-notification-sandbox-TXT[0]`       |
|        | `aws_route53_record.dmarc-staging-notification-sandbox-TXT[0]`        |
|        | `aws_route53_record.ses-staging-notification-sandbox-TXT[0]`          |
|        | `aws_route53_record.staging-custom-domain-aws-ses-sandbox-TXT[0]`     |
|        | `aws_route53_record.staging-custom-domain-ses-sandbox-TXT[0]`         |
|        | `aws_route53_record.staging-notification-sandbox-MX[0]`               |
|        | `aws_route53_record.staging-notification-sandbox-TXT[0]`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.assets-staging-notification-sandbox-CNAME[0] will be destroyed
  # (because aws_route53_record.assets-staging-notification-sandbox-CNAME is not in configuration)
  - resource "aws_route53_record" "assets-staging-notification-sandbox-CNAME" {
      - fqdn                             = "assets.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_assets.staging.notification.cdssandbox.xyz_CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "assets.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "d3ukkp8cndubgn.cloudfront.net",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.bounce-custom-notification-sandbox-MX[0] will be created
  + resource "aws_route53_record" "bounce-custom-notification-sandbox-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bounce.custom-sending-domain.staging.notification.cdssandbox.xyz"
      + records         = [
          + "10 feedback-smtp.ca-central-1.amazonses.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.bounce-notification-sandbox-MX[0] will be created
  + resource "aws_route53_record" "bounce-notification-sandbox-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bounce.staging.notification.cdssandbox.xyz"
      + records         = [
          + "10 feedback-smtp.ca-central-1.amazonses.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.bounce-notification-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "bounce-notification-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bounce.staging.notification.cdssandbox.xyz"
      + records         = [
          + "v=spf1 include:amazonses.com ~all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.bounce-staging-custom-notification-sandbox-MX[0] will be destroyed
  # (because aws_route53_record.bounce-staging-custom-notification-sandbox-MX is not in configuration)
  - resource "aws_route53_record" "bounce-staging-custom-notification-sandbox-MX" {
      - fqdn                             = "bounce.custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_bounce.custom-sending-domain.staging.notification.cdssandbox.xyz_MX" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "bounce.custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "10 feedback-smtp.ca-central-1.amazonses.com",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "MX" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.bounce-staging-notification-sandbox-MX[0] will be destroyed
  # (because aws_route53_record.bounce-staging-notification-sandbox-MX is not in configuration)
  - resource "aws_route53_record" "bounce-staging-notification-sandbox-MX" {
      - fqdn                             = "bounce.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_bounce.staging.notification.cdssandbox.xyz_MX" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "bounce.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "10 feedback-smtp.ca-central-1.amazonses.com",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "MX" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.bounce-staging-notification-sandbox-TXT[0] will be destroyed
  # (because aws_route53_record.bounce-staging-notification-sandbox-TXT is not in configuration)
  - resource "aws_route53_record" "bounce-staging-notification-sandbox-TXT" {
      - fqdn                             = "bounce.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_bounce.staging.notification.cdssandbox.xyz_TXT" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "bounce.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "v=spf1 include:amazonses.com ~all",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "TXT" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.custom-domain-aws-ses-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "custom-domain-aws-ses-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz"
      + records         = [
          + "fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.custom-domain-ses-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "custom-domain-ses-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + records         = [
          + "amazonses:fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.dmarc-notification-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "dmarc-notification-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.staging.notification.cdssandbox.xyz"
      + records         = [
          + "v=DMARC1; p=reject; sp=reject; pct=100; rua=mailto:dmarc@cyber.gc.ca; ruf=mailto:dmarc@cyber.gc.ca",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.dmarc-staging-notification-sandbox-TXT[0] will be destroyed
  # (because aws_route53_record.dmarc-staging-notification-sandbox-TXT is not in configuration)
  - resource "aws_route53_record" "dmarc-staging-notification-sandbox-TXT" {
      - fqdn                             = "_dmarc.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__dmarc.staging.notification.cdssandbox.xyz_TXT" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_dmarc.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "v=DMARC1; p=reject; sp=reject; pct=100; rua=mailto:dmarc@cyber.gc.ca; ruf=mailto:dmarc@cyber.gc.ca",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "TXT" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-sandbox-MX[0] will be created
  + resource "aws_route53_record" "notification-sandbox-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.notification.cdssandbox.xyz"
      + records         = [
          + "10 inbound-smtp.us-east-1.amazonaws.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "notification-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.notification.cdssandbox.xyz"
      + records         = [
          + "google-site-verification=u0zkO-jbYi1qW2G65mfXbuNl14BCO1O9uk-BV2wTlD8",
          + "v=spf1 include:amazonses.com ~all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.ses-notification-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "ses-notification-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.staging.notification.cdssandbox.xyz"
      + records         = [
          + "AwTGEoIByR4QGirawhDmRdJmxFO/U0fX3NMrSOJpuI4=",
          + "vJFwJM0wnPRWKFXsoiVl9/gLXFP4RL5Xfl4C9JTp3VI=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.ses-staging-notification-sandbox-TXT[0] will be destroyed
  # (because aws_route53_record.ses-staging-notification-sandbox-TXT is not in configuration)
  - resource "aws_route53_record" "ses-staging-notification-sandbox-TXT" {
      - fqdn                             = "_amazonses.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__amazonses.staging.notification.cdssandbox.xyz_TXT" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_amazonses.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "AwTGEoIByR4QGirawhDmRdJmxFO/U0fX3NMrSOJpuI4=",
          - "vJFwJM0wnPRWKFXsoiVl9/gLXFP4RL5Xfl4C9JTp3VI=",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "TXT" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.staging-custom-domain-aws-ses-sandbox-TXT[0] will be destroyed
  # (because aws_route53_record.staging-custom-domain-aws-ses-sandbox-TXT is not in configuration)
  - resource "aws_route53_record" "staging-custom-domain-aws-ses-sandbox-TXT" {
      - fqdn                             = "_amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz_TXT" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "TXT" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.staging-custom-domain-ses-sandbox-TXT[0] will be destroyed
  # (because aws_route53_record.staging-custom-domain-ses-sandbox-TXT is not in configuration)
  - resource "aws_route53_record" "staging-custom-domain-ses-sandbox-TXT" {
      - fqdn                             = "custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_custom-sending-domain.staging.notification.cdssandbox.xyz_TXT" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "amazonses:fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "TXT" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.staging-notification-sandbox-MX[0] will be destroyed
  # (because aws_route53_record.staging-notification-sandbox-MX is not in configuration)
  - resource "aws_route53_record" "staging-notification-sandbox-MX" {
      - fqdn                             = "staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_staging.notification.cdssandbox.xyz_MX" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "10 inbound-smtp.us-east-1.amazonaws.com",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "MX" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.staging-notification-sandbox-TXT[0] will be destroyed
  # (because aws_route53_record.staging-notification-sandbox-TXT is not in configuration)
  - resource "aws_route53_record" "staging-notification-sandbox-TXT" {
      - fqdn                             = "staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_staging.notification.cdssandbox.xyz_TXT" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "google-site-verification=u0zkO-jbYi1qW2G65mfXbuNl14BCO1O9uk-BV2wTlD8",
          - "v=spf1 include:amazonses.com ~all",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "TXT" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
    }

Plan: 9 to add, 0 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pond_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
